system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/
probes
{
    type            probes;
    libs            ("libsampling.so");

    // Name of the directory for probe data
    name            probes;

    // Write at same frequency as fields
    writeControl    timeStep;
    writeInterval   1;

fields (
        p 
        U 
       );

probeLocations
(

	(0.15 0.05 0)
	(0.15 0 0)
	(0.15 -0.05 0)
	
	(0.35 0.1 0)
	(0.35 0.05 0)
	(0.35 0 0)
	(0.35 -0.05 0)
	(0.35 -0.1 0)
	
	(0.55 0.1 0)
	(0.55 -0.05 0)
	(0.55 0 0)
	(0.55 -0.05 0)
	(0.55 -0.1 0)
	
);
    // Optional: filter out points that haven't been found. Default
    //           is to include them (with value -VGREAT)
    includeOutOfBounds  true;
}
// ************************************************************************* //
